sample/hashi/mb-op/nomad-hr-wrk-mixed-c6525-25g-exp12-havail0-hori1-verti1-infi1-t4-c512-d30-R18000
Using argument nginx
using  args: threads=4 and connections=512 and duration=30 and requests=18000
Running 30s test @ http://10.10.1.4:5000
  4 threads and 512 connections
  Thread calibration: mean lat.: 3499.898ms, rate sampling interval: 12926ms
  Thread calibration: mean lat.: 3526.255ms, rate sampling interval: 12926ms
  Thread calibration: mean lat.: 3429.899ms, rate sampling interval: 12795ms
  Thread calibration: mean lat.: 3337.800ms, rate sampling interval: 11845ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    14.17s     4.15s   21.66s    58.61%
    Req/Sec     1.25k     2.28     1.25k    75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.13s 
 75.000%   17.69s 
 90.000%   19.92s 
 99.000%   21.66s 
 99.900%   22.40s 
 99.990%   22.90s 
 99.999%   23.18s 
100.000%   23.43s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5816.319     0.000000            1         1.00
    8486.911     0.100000         9815         1.11
    9920.511     0.200000        19598         1.25
   11329.535     0.300000        29383         1.43
   12754.943     0.400000        39163         1.67
   14131.199     0.500000        48981         2.00
   14802.943     0.550000        53865         2.22
   15507.455     0.600000        58769         2.50
   16211.967     0.650000        63665         2.86
   16941.055     0.700000        68517         3.33
   17694.719     0.750000        73441         4.00
   18071.551     0.775000        75921         4.44
   18431.999     0.800000        78351         5.00
   18808.831     0.825000        80842         5.71
   19169.279     0.850000        83201         6.67
   19546.111     0.875000        85643         8.00
   19742.719     0.887500        86892         8.89
   19922.943     0.900000        88109        10.00
   20119.551     0.912500        89362        11.43
   20316.159     0.925000        90625        13.33
   20512.767     0.937500        91806        16.00
   20611.071     0.943750        92401        17.78
   20709.375     0.950000        92995        20.00
   20824.063     0.956250        93614        22.86
   20938.751     0.962500        94219        26.67
   21069.823     0.968750        94841        32.00
   21135.359     0.971875        95152        35.56
   21200.895     0.975000        95428        40.00
   21282.815     0.978125        95766        45.71
   21364.735     0.981250        96070        53.33
   21463.039     0.984375        96385        64.00
   21512.191     0.985938        96517        71.11
   21577.727     0.987500        96696        80.00
   21626.879     0.989062        96832        91.43
   21692.415     0.990625        96962       106.67
   21790.719     0.992188        97129       128.00
   21823.487     0.992969        97191       142.22
   21872.639     0.993750        97278       160.00
   21905.407     0.994531        97348       182.86
   21954.559     0.995313        97419       213.33
   22036.479     0.996094        97505       256.00
   22069.247     0.996484        97545       284.44
   22085.631     0.996875        97569       320.00
   22134.783     0.997266        97621       365.71
   22167.551     0.997656        97648       426.67
   22216.703     0.998047        97692       512.00
   22249.471     0.998242        97705       568.89
   22282.239     0.998437        97725       640.00
   22315.007     0.998633        97752       731.43
   22347.775     0.998828        97763       853.33
   22396.927     0.999023        97783      1024.00
   22429.695     0.999121        97793      1137.78
   22462.463     0.999219        97804      1280.00
   22478.847     0.999316        97809      1462.86
   22511.615     0.999414        97819      1706.67
   22544.383     0.999512        97828      2048.00
   22560.767     0.999561        97831      2275.56
   22642.687     0.999609        97838      2560.00
   22675.455     0.999658        97843      2925.71
   22691.839     0.999707        97847      3413.33
   22757.375     0.999756        97851      4096.00
   22773.759     0.999780        97853      4551.11
   22790.143     0.999805        97855      5120.00
   22822.911     0.999829        97858      5851.43
   22839.295     0.999854        97861      6826.67
   22888.447     0.999878        97863      8192.00
   22904.831     0.999890        97864      9102.22
   22937.599     0.999902        97865     10240.00
   22953.983     0.999915        97867     11702.86
   22953.983     0.999927        97867     13653.33
   23003.135     0.999939        97869     16384.00
   23003.135     0.999945        97869     18204.44
   23019.519     0.999951        97870     20480.00
   23019.519     0.999957        97870     23405.71
   23052.287     0.999963        97871     27306.67
   23117.823     0.999969        97872     32768.00
   23117.823     0.999973        97872     36408.89
   23117.823     0.999976        97872     40960.00
   23117.823     0.999979        97872     46811.43
   23183.359     0.999982        97873     54613.33
   23183.359     0.999985        97873     65536.00
   23183.359     0.999986        97873     72817.78
   23183.359     0.999988        97873     81920.00
   23183.359     0.999989        97873     93622.86
   23429.119     0.999991        97874    109226.67
   23429.119     1.000000        97874          inf
#[Mean    =    14166.785, StdDeviation   =     4150.793]
#[Max     =    23412.736, Total count    =        97874]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  148093 requests in 30.00s, 61.22MB read
Requests/sec:   4935.83
Transfer/sec:      2.04MB