sample/hashi/mb-op/nomad-hr-wrk-mixed-c6525-25g-exp12-havail0-hori1-verti1-infi1-t4-c512-d30-R3000
Using argument nginx
using  args: threads=4 and connections=512 and duration=30 and requests=3000
Running 30s test @ http://10.10.1.4:5000
  4 threads and 512 connections
  Thread calibration: mean lat.: 5.963ms, rate sampling interval: 28ms
  Thread calibration: mean lat.: 5.897ms, rate sampling interval: 26ms
  Thread calibration: mean lat.: 6.241ms, rate sampling interval: 28ms
  Thread calibration: mean lat.: 5.942ms, rate sampling interval: 27ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     7.46ms    9.77ms  49.98ms   89.95%
    Req/Sec   765.06    247.19     1.48k    72.37%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.24ms
 75.000%    9.38ms
 90.000%   17.31ms
 99.000%   49.98ms
 99.900%   86.97ms
 99.990%  109.44ms
 99.999%  121.54ms
100.000%  134.53ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.266     0.000000            1         1.00
       0.795     0.100000         5984         1.11
       1.338     0.200000        11947         1.25
       2.107     0.300000        17923         1.43
       3.033     0.400000        23893         1.67
       4.243     0.500000        29883         2.00
       4.971     0.550000        32855         2.22
       5.795     0.600000        35833         2.50
       6.775     0.650000        38820         2.86
       7.947     0.700000        41804         3.33
       9.375     0.750000        44792         4.00
      10.207     0.775000        46282         4.44
      11.167     0.800000        47775         5.00
      12.279     0.825000        49267         5.71
      13.663     0.850000        50761         6.67
      15.255     0.875000        52251         8.00
      16.183     0.887500        53001         8.89
      17.311     0.900000        53746        10.00
      18.511     0.912500        54495        11.43
      20.015     0.925000        55236        13.33
      22.015     0.937500        55979        16.00
      23.119     0.943750        56352        17.78
      24.415     0.950000        56727        20.00
      25.887     0.956250        57098        22.86
      27.839     0.962500        57470        26.67
      30.287     0.968750        57845        32.00
      31.711     0.971875        58032        35.56
      33.503     0.975000        58217        40.00
      35.775     0.978125        58403        45.71
      38.911     0.981250        58593        53.33
      41.823     0.984375        58777        64.00
      44.191     0.985938        58870        71.11
      46.303     0.987500        58964        80.00
      48.511     0.989062        59058        91.43
      51.711     0.990625        59150       106.67
      55.615     0.992188        59244       128.00
      58.079     0.992969        59291       142.22
      59.935     0.993750        59336       160.00
      63.167     0.994531        59383       182.86
      66.047     0.995313        59430       213.33
      68.287     0.996094        59476       256.00
      69.759     0.996484        59500       284.44
      71.167     0.996875        59524       320.00
      73.151     0.997266        59548       365.71
      74.623     0.997656        59570       426.67
      76.479     0.998047        59593       512.00
      78.271     0.998242        59605       568.89
      79.807     0.998437        59616       640.00
      82.047     0.998633        59628       731.43
      83.903     0.998828        59640       853.33
      87.423     0.999023        59651      1024.00
      88.639     0.999121        59657      1137.78
      91.391     0.999219        59663      1280.00
      93.183     0.999316        59669      1462.86
      94.463     0.999414        59676      1706.67
      95.487     0.999512        59680      2048.00
      97.343     0.999561        59683      2275.56
      98.367     0.999609        59686      2560.00
     101.119     0.999658        59689      2925.71
     104.127     0.999707        59692      3413.33
     106.111     0.999756        59695      4096.00
     106.239     0.999780        59696      4551.11
     106.687     0.999805        59699      5120.00
     106.687     0.999829        59699      5851.43
     107.071     0.999854        59701      6826.67
     109.375     0.999878        59702      8192.00
     109.439     0.999890        59703      9102.22
     110.015     0.999902        59704     10240.00
     110.015     0.999915        59704     11702.86
     111.359     0.999927        59705     13653.33
     112.191     0.999939        59706     16384.00
     112.191     0.999945        59706     18204.44
     115.455     0.999951        59707     20480.00
     115.455     0.999957        59707     23405.71
     115.455     0.999963        59707     27306.67
     121.535     0.999969        59708     32768.00
     121.535     0.999973        59708     36408.89
     121.535     0.999976        59708     40960.00
     121.535     0.999979        59708     46811.43
     121.535     0.999982        59708     54613.33
     134.527     0.999985        59709     65536.00
     134.527     1.000000        59709          inf
#[Mean    =        7.460, StdDeviation   =        9.771]
#[Max     =      134.400, Total count    =        59709]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  89115 requests in 30.01s, 36.81MB read
  Socket errors: connect 0, read 0, write 0, timeout 1
Requests/sec:   2969.68
Transfer/sec:      1.23MB